#Токен бота, можна отримати в BotFather в телеграм
#TOKEN_API

#ID канала, в який буде пересилатися всі повідомлення
#CHANNEL_ID

#Хеш  та айді апі, можна взяти в налаштуваннях аккаунту телеграма.
#Використовуються для пересилання повідомлень аккаунтом та керування ними.
#API_ID, API_HASH

#ID_BOT
#Айдішнік бота телеграма, тут все логічно.

############################################################
############################################################

CONFIGURATION = {
    'TOKEN_API' : '6064195503:AAHdQeQ6LA4T2BPoDTBozkOucEIwCTcliQo',
    'CHANNEL_ID' : '-1001900232820',
    'API_ID' : '24607193',
    'API_HASH' : '75e0b0af6c73a423bb12bc1ee0e9c14c',
    'ID_BOT' : '@copycatpetrov_bot',
    'DB_HOST' : 'localhost',
    'DB_USER' : 'root',
    'DB_NAME' : 'resend_bot',
    'DB_PASSWORD' : 'root1234',
    'SENDER_EMAIL' : 'stonehaven.reset@gmail.com',
    'APP_PASSWORD' : 'lfemarbsgejrcfmq'
    
}

ERRORS = {
    'ERROR_404' : '<b>😔 Невідома помилка, зверніться до адміністратора боту!</b>',
    'ERROR_DELETE' : '<b>😔 Помилка при видаленні повідомлення! Видаліть вручну!</b>',
    'ERROR_FORWARD' : '<b>😔 Помилка при пересиланні повідомлення, зверніться до адміністратора боту!</b>',
    'ERROR_SEND' : '<b>😔 Невідома помилка при надсилання повідомлення, зверніться до адміністратора боту!</b>'
}
