from python_socks import ProxyType

proxy = {
        'proxy_type': ProxyType.SOCKS5,
        'addr': "45.56.124.180",
        'port': 27614,
        'username': "modeler_2B6ifs",
        'password': "aNIxmx0U6huI",
        'rdns': True
    }


# accounts = [
#     {"api_id": "", "api_hash": "", "session": "main_bot", "phone_number": "", "name": "Max"}#Andrey
#     #{"api_id": "", "api_hash": "", "session": "session_02", "name": "Angelo_bot"} #Max
# ]


photos = ['/Users/zgutadenis/Desktop/Work/SpamBot2.0_Petrov/1.jpeg',
          '/Users/zgutadenis/Desktop/Work/SpamBot2.0_Petrov/2.jpeg'
        ]


telegram_nicknames = [
    "Чатозавр",
    "Телеграмбуфер",
    "Стикерист",
    "Рассветчик",
    "Мемолог",
    "Гифоман",
    "Селфифейс",
    "Зависайчик",
    "Групоняша",
    "Комментарийчик",
    "Чатодром",
    "Флудонавт",
]

#API та Хеш головного бота
API_ID = ""
API_HASH = ''


text = "{П{р|𝓅}ив{е|𝑒}т| Зд{а|𝒶}{р|𝓅}{о|𝑜}в| К{у|𝓎}| Зд{𝓅|𝓅}{𝒶|𝒶}в{с|𝒸}тв{у|𝓎}й| П{р|𝓅}ив{е|𝑒}тик}. {𝒯|Т̾}{у|у̷}{т̶|т̷} {{𝒸|𝕔}{л͓̽|л̶}{и̷|и̾}{в |в}|{{е̷|е̴}{б̾|б͓̽}{л͓̽|л}{я̲|я̶}}|{{в|в̶}{и̷|и̶}{д̷|д̶}{𝑒|е}{𝓸|ό}}} {{р̶|р̷}{у̷|у̴}{с|𝒸}{с͓̽|с̾}{к|к̷}{и̴|и̷}{х̶|х͓̽}|{к̶|𝓀}{а̷|а̾}{ц|ц̷}{𝒶|а}{п̶|п̷}{с͓̽|с̶}{к̴|к}{и|и̾}{х̴|х̶}|{в|в̾}{𝒶|а͓̽}{г̴|г̶}{н̷|н}{е̷|е̴}{р̶|р̴}{𝑜|о̲}{в̷|в̶}{с|𝒸}{𝓀|к̷}{и̶|и̾}{х̶|х̷}} {ч̷|ч̾}{м̷|м̶}{𝑜|о̴}{б̶|б̴}{и|и̾}{𝓀|к̾}{𝑜|о̷}{в̾|в̷}. {{П̷|П̾}{о |о̷}{𝒸|с̾}{т͎|т̷}{я̾|я͓̽}{т̾|т̴}|{К͓̽|К̶}{и̷|и}{д̷|д̾}{а̶|а̷}{ю̷|ю̷}{т̷|т͓̽}|{Л̷|Л}{ь̷|ь̾}{ю̶|ю}{т̾|т͓̽}|Д{е|е}л{а|𝒶}ют|{о|𝑜}тп{р|𝓅}{а|𝒶}вляют|Залив{а|𝒶}ют} {{л̴|л̶}ютый|с{у|𝓎}м{а|𝒶}сш{е|е}дший|н{е|е}в{о|𝑜}{о|𝑜}б{р|𝓅}{а|𝒶}зимый} т{р|𝓅}еш, мн{е|𝑒} {п{о|𝑜}н{р|𝓅}{а|𝒶}вил{о|𝑜}сь|з{а|𝒶}шл{о|𝑜}|п{р|𝓅}иглян{у|𝓎}л{о|𝑜}сь} и т{е|е}б{е|е} дум{а|𝒶}ю {п{о|𝑜}н{р|𝓅}{а|𝒶}вится|з{а|𝒶}йд{е|е}т|п{р|𝓅}иглян{е|е}тся}, {с{с͎|с̷}ылка|лин{к̶|к͓̽}} в би{о̷|о̾}"
